//------------------------------------------------------------------------------
//
// プレイヤー [CPlayer.cpp]
// Author : AT-13A-273 Shinnosuke Munakata
//
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// ヘッダインクルード
//------------------------------------------------------------------------------
#include <math.h>

#include "main.h"
#include "CPlayer.h"
#include "Keyboard.h"
#include "Camera.h"
#include "CBullet.h"
#include "CommonGL.h"

//------------------------------------------------------------------------------
// コンストラクタ
//------------------------------------------------------------------------------
// 引数
//  なし
//------------------------------------------------------------------------------
CPlayer::CPlayer():CModel()
{
	// 移動速度
	Speed = PLAYER_MOVE_SPEED;

	// 弾初期化
	Bullet = nullptr;
}

//------------------------------------------------------------------------------
// デストラクタ
//------------------------------------------------------------------------------
// 引数
//  なし
//------------------------------------------------------------------------------
CPlayer::~CPlayer()
{

}

//------------------------------------------------------------------------------
// 初期化
//------------------------------------------------------------------------------
// 引数
//  なし
// 戻り値
//  なし
//------------------------------------------------------------------------------
void CPlayer::Init(void)
{
	// 弾
	Bullet = nullptr;

	// 継承元の初期化
	CModel::Init();
}

//------------------------------------------------------------------------------
// 更新
//------------------------------------------------------------------------------
// 引数
//  なし
// 戻り値
//  なし
//------------------------------------------------------------------------------
void CPlayer::Update()
{
	VECTOR3 rot = VECTOR3(0.0f, 0.0f, 0.0f);

	// 移動
	// 上
	if(CKeyboard::GetPress(DIK_W))
	{
		Movement.x += sinf(Rot().y) * Speed;
		Movement.z += cosf(Rot().y) * Speed;
	}

	// 下
	else if (CKeyboard::GetPress(DIK_S))
	{
		Movement.x -= sinf(Rot().y) * Speed;
		Movement.z -= cosf(Rot().y) * Speed;
	}

	// 左
	if(CKeyboard::GetPress(DIK_A))
	{
		rot.y += 3.0f;
	}

	// 右
	else if(CKeyboard::GetPress(DIK_D))
	{
		rot.y -= 3.0f;
	}

	// キャラクターの回転
	AddRot(rot);

	// 値の丸め込み
	if( Rot().y > 360.0f)
	{
		SetRotY(Rot().y - 2 * 360.0f);
	}
	else if (Rot().y < -360.0f)
	{
		SetRotY(Rot().y + 2 * 360.0f);
	}

	// キャラクターの移動
	AddPos(Movement);

	// 減速
	Movement *= 0.95f;

	// 攻撃
	if(CKeyboard::GetTrigger(DIK_SPACE))
	{
		if(LaunchFlag == false)
		{
			LaunchFlag = true;
			Bullet = CBullet::Create(_Pos, VECTOR2(40.0f, 40.0f), VECTOR3(0.0f, 0.0f, 0.0f), WHITE(0.5f));
		}
	}
}

//------------------------------------------------------------------------------
// 
//------------------------------------------------------------------------------
// 引数
//  なし
// 戻り値
//  なし
//------------------------------------------------------------------------------
CPlayer* CPlayer::Create(int id,const VECTOR3& pos)
{
	CPlayer* model = new CPlayer;
	if (model == nullptr){ return nullptr; }

	model->ModelID = id;
	model->_Pos = pos;
	model->Init();

	return model;
}

//------------------------------------------------------------------------------
// EOF