//=============================================================================
//
// 装填中の文字 [LoadString.h]
//
// Auther : masato masuda
//
//=============================================================================

//=============================================================================
// include guard
//=============================================================================
#ifndef _LOAD_STRING_H_
#define _LOAD_STRING_H_

//=============================================================================
// include
//=============================================================================
#include "main.h"
#include "Polygon2D.h"

//=============================================================================
// class
//=============================================================================
class CLoadString :public CPolygon2D
{
public:

  CLoadString();
  ~CLoadString(){}

  void Init(void);
  void Update(void);

  //===========================================================================
  // Create
  //---------------------------------------------------------------------------
  //	VECTOR3 ： 中心座標
  //	VECTOR2 ： 大きさ
  //	VECTOR3 ： 回転
  //	COLOR   ： 頂点カラー
  //===========================================================================
  static CLoadString* Create(const VECTOR3& pos,const VECTOR2& size,const VECTOR3& rot=VECTOR3(0,0,0),const COLOR& color=COLOR(1.0f,1.0f,1.0f,1.0f));

  // Geter / Seter
  void DrawEnable(void);
  void DrawDisable(void);

private:

  bool  drawFlag;
  float alphaMove;
};

#endif

// end of file