//=============================================================================
// CSmokeクラス [Smoke.h]
// Author :Mai Tanabe
//=============================================================================
#ifndef _MY_SMOKE_H
#define _MY_SMOKE_H
//=============================================================================
// インクルード
//=============================================================================
#include "main.h"
#include "Billboard.h"

//=============================================================================
// クラス定義
//=============================================================================
class CSmoke : public CBillboard
{
public:
	CSmoke(){};
	~CSmoke(){};

	static void Create(const VECTOR3& pos);
	void Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:
	int m_cntAnim;
};

#endif