//=============================================================================
//2Dライフクラス
//Kikushima
//=============================================================================
#ifndef _TIME_H_
#define _TIME_H_
//=============================================================================
//インクルード
//=============================================================================
#include "main.h"
#include "Polygon2D.h"

//クラス定義
class CTime :public CPolygon2D
{
public:
	CTime();
	~CTime(){}
	void Init(void);
	void Uninit(void);
	void Update(void);

	//=============================================================================
	//作成
	//引数：
	//	VECTOR3：中心座標
	//	VECTOR2：大きさ
	//	VECTOR3：回転
	//	COLOR：	頂点カラー
	//=============================================================================
	static CTime* Create(const VECTOR3& pos, const VECTOR2& size, const VECTOR3& rot = VECTOR3(0, 0, 0), const COLOR& color = COLOR(1.0f, 1.0f, 1.0f, 1.0f));

	//=============================================================================
	//ゲッター
	//=============================================================================


private:
	int TimeCount;
	int Timer;
	float x;//vtx用
	float y;//vtx用
};

#endif